app/views/visitors/index.html.erb

<h3>Welcome</h3>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
<p><%= link_to 'Cities:', cities_path %> <%= City.count %> </p>
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "cities"