app/views/users/show.html.erb

<p>Date of birth: <%= @user.date_of_birth.strftime("%d-%m-%Y") if @user.date_of_birth %></p>
<p>City: <%= City.find_by(id: @user.city_id).name if @user.city_id %></p>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 2]]