app/controllers/cities_controller.rb

  def index
    @cities = City.paginate(:page => params[:page], :per_page => 4)
---
SELECT  "cities".* FROM "cities" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "cities"

  def create
    @city = City.new(city_params)
    flash[:notice] = 'City was successfully created.' if @city.save
---
INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "Ld"], ["created_at", "2015-02-27 13:38:03.248272"], ["updated_at", "2015-02-27 13:38:03.248272"]]

  def update
    flash[:notice] = 'City was successfully updated.' if @city.update(city_params)
---
UPDATE "cities" SET "short_name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["short_name", "Waw"], ["updated_at", "2015-02-27 14:20:14.223004"], ["id", 3]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 1]]

    def set_city
      @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 3]]